deploy_build/app/Models/PenggajianModel.php

SELECT `bulan`, `tahun`, SUM(gaji_bersih) as total_gaji_bersih, COUNT(id) as total_karyawan
FROM `penggajian`
GROUP BY `tahun`, `bulan`
ORDER BY `tahun` ASC, `bulan` ASC
---
    public function getPenggajianFull($bulan = null, $tahun = null, $karyawanId = null, $id = null, $search = null)
    {
        $builder = $this->db->table('penggajian g')
            ->select('g.*, k.nip, k.nama, k.status_nikah, k.jumlah_anak, k.alamat, k.no_telp, j.nama_jabatan, u.email')
            ->join('karyawan k', 'k.id = g.karyawan_id', 'inner')
            ->join('jabatan j', 'j.id = k.jabatan_id', 'left')
            ->join('users u', 'u.id = k.user_id', 'left');

        if ($id !== null) {
            return $builder->where('g.id', $id)->get()->getRowArray();
        }
        if ($bulan !== null) {
            $builder->where('g.bulan', $bulan);
        }
        if ($tahun !== null) {
            $builder->where('g.tahun', $tahun);
        }
        if ($karyawanId !== null) {
            $builder->where('g.karyawan_id', $karyawanId);
        }
        if (!empty($search)) {
            $builder->groupStart()
                ->like('k.nama', $search)
                ->orLike('k.nip', $search)
                ->orLike('g.kode_transaksi', $search)
                ->orLike('j.nama_jabatan', $search)
                ->groupEnd();
        }

        return $builder->orderBy('g.id', 'DESC')->get()->getResultArray();