deploy_build/app/Controllers/BaseController.php

SELECT *
FROM `karyawan`
WHERE `user_id` = '2'
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        // Auto-sync session data for logged-in Karyawan to reflect live DB changes (e.g. photo updated by Admin)
        $session = service('session');
        if ($session->get('isLoggedIn') && $session->get('role') === 'karyawan') {
            $userId = $session->get('userId');
            $db = \Config\Database::connect();
            $karyawan = $db->table('karyawan')->where('user_id', $userId)->get()->getRowArray();