deploy_build/app/Controllers/Dashboard.php

    public function index()
    {
        $karyawanModel  = new KaryawanModel();
        $jabatanModel   = new JabatanModel();
        $presensiModel  = new PresensiModel();
        $penggajianModel = new PenggajianModel();

        $role = session()->get('role');
        $karyawanId = session()->get('karyawanId');

        $data = [
            'title' => 'Dashboard Overview',
        ];

        if ($role === 'admin') {
            $data['totalKaryawan'] = $karyawanModel->countAllResults();
            $data['totalJabatan']  = $jabatanModel->countAllResults();

            $currentMonth = (int)date('m');
            $currentYear  = (int)date('Y');

            $data['totalPresensi'] = $presensiModel->where('bulan', $currentMonth)
                                                   ->where('tahun', $currentYear)
                                                   ->countAllResults();

            $totalGajiRow = $penggajianModel->selectSum('gaji_bersih')
                                            ->where('bulan', 7) // Bulan 7 2026 data uji
                                            ->where('tahun', 2026)
                                            ->first();
---
SELECT COUNT(*) AS `numrows`
FROM `karyawan`
SELECT COUNT(*) AS `numrows`
FROM `jabatan`
SELECT COUNT(*) AS `numrows`
FROM `presensi`
WHERE `bulan` = 8
AND `tahun` = 2026
SELECT SUM(`gaji_bersih`) AS `gaji_bersih`
FROM `penggajian`
WHERE `bulan` = 7
AND `tahun` = 2026
 LIMIT 1