deploy_build/app/Controllers/Karyawan.php

SELECT COUNT(*) AS `numrows`
FROM `karyawan`
LEFT JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`jabatan_id`
LEFT JOIN `users` ON `users`.`id` = `karyawan`.`user_id`
SELECT `karyawan`.*, `jabatan`.`nama_jabatan`, `users`.`username`, `users`.`email`
FROM `karyawan`
LEFT JOIN `jabatan` ON `jabatan`.`id` = `karyawan`.`jabatan_id`
LEFT JOIN `users` ON `users`.`id` = `karyawan`.`user_id`
ORDER BY `karyawan`.`nama` ASC
 LIMIT 10
SELECT *
FROM `jabatan`
---
    public function index()
    {
        $keyword = $this->request->getGet('search');

        $builder = $this->karyawanModel->select('karyawan.*, jabatan.nama_jabatan, users.username, users.email')
            ->join('jabatan', 'jabatan.id = karyawan.jabatan_id', 'left')
            ->join('users', 'users.id = karyawan.user_id', 'left');

        if (! empty($keyword)) {
            $builder->groupStart()
                ->like('karyawan.nip', $keyword)
                ->orLike('karyawan.nama', $keyword)
                ->orLike('jabatan.nama_jabatan', $keyword)
                ->orLike('karyawan.alamat', $keyword)
                ->groupEnd();
        }

        $karyawanList = $builder->orderBy('karyawan.nama', 'ASC')->paginate(10);

        $data = [
            'title'        => 'Data Karyawan',
            'karyawanList' => $karyawanList,
            'pager'        => $this->karyawanModel->pager,
            'jabatanList'  => $this->jabatanModel->findAll(),

SELECT *
FROM `karyawan`
WHERE `karyawan`.`id` = '1'
---
    public function update($id = null)
    {
        $karyawan = $this->karyawanModel->find($id);

UPDATE `karyawan` SET `nip` = 'NIP2026001', `nama` = 'Ahmad Rizki', `jenis_kelamin` = 'L', `tempat_lahir` = 'Lhokseumawe', `tanggal_lahir` = '1992-05-14', `alamat` = 'Jl. Merdeka No. 12, Lhokseumawe', `no_telp` = '081269001111', `foto` = '1785682162_62d7cc7a428bd534044d.jpg', `jabatan_id` = '1', `tanggal_masuk` = '2022-01-10', `status_nikah` = 'Menikah', `jumlah_anak` = '2', `updated_at` = '2026-08-02 14:49:22'
WHERE `karyawan`.`id` IN ('1')
---
            }
        }

        $this->karyawanModel->update($id, [
            'nip'           => $this->request->getPost('nip'),
            'nama'          => $this->request->getPost('nama'),
            'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
            'tempat_lahir'  => $this->request->getPost('tempat_lahir'),
            'tanggal_lahir' => $this->request->getPost('tanggal_lahir') ?: null,
            'alamat'        => $this->request->getPost('alamat'),
            'no_telp'       => $this->request->getPost('no_telp'),
            'foto'          => $namaFoto,
            'jabatan_id'    => $this->request->getPost('jabatan_id'),
            'tanggal_masuk' => $this->request->getPost('tanggal_masuk'),
            'status_nikah'  => $this->request->getPost('status_nikah'),
            'jumlah_anak'   => $this->request->getPost('jumlah_anak'),
        ]);