deploy_build/app/Controllers/Profile.php

    public function index()
    {
        $userId = session()->get('userId');
        $role   = session()->get('role');

        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    public function update()
    {
        $userId = session()->get('userId');
        $role   = session()->get('role');

        $rules = [
            'no_telp' => 'permit_empty|min_length[8]|max_length[20]',
            'alamat'  => 'permit_empty',
            'foto'    => 'permit_empty|is_image[foto]|mime_in[foto,image/jpg,image/jpeg,image/png,image/webp]|max_size[foto,2048]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $karyawan = $this->karyawanModel->where('user_id', $userId)->first();
        $oldFoto  = $karyawan ? $karyawan['foto'] : (session()->get('foto') ?: 'default.png');
---
SELECT *
FROM `karyawan`
WHERE `user_id` = '2'
 LIMIT 1

        }

        if ($karyawan) {
            $this->karyawanModel->update($karyawan['id'], [
                'no_telp' => $this->request->getPost('no_telp') ?: $karyawan['no_telp'],
                'alamat'  => $this->request->getPost('alamat') ?: $karyawan['alamat'],
                'foto'    => $namaFoto,
            ]);
---
UPDATE `karyawan` SET `no_telp` = '081269001111', `alamat` = 'Jl. Merdeka No. 12, Lhokseumawe', `foto` = '1785682401_b1ce86c954f3178c3730.png', `updated_at` = '2026-08-02 14:53:21'
WHERE `karyawan`.`id` IN ('1')