app/Controllers/Auth.php

    public function processLogin()
    {
        if (strtolower($this->request->getMethod()) !== 'post') {
            return redirect()->to('/login');
        }

        $session = session();
        $userModel = new UserModel();

        $rules = [
            'username' => 'required',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', 'Username dan password wajib diisi.');
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $userModel->where('username', $username)
                          ->orWhere('email', $username)
                          ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin '
OR `email` = 'admin '
 LIMIT 1