app/Models/KaryawanModel.php

    public function getKaryawanByUserId($userId)
    {
        return $this->db->table('karyawan k')
            ->select('k.*, j.nama_jabatan, j.gaji_pokok, j.tunj_jabatan, j.tunj_makan_per_hari, j.tunj_transport_per_hari, u.username, u.email')
            ->join('jabatan j', 'j.id = k.jabatan_id', 'left')
            ->join('users u', 'u.id = k.user_id', 'left')
            ->where('k.user_id', $userId)
            ->get()
            ->getRowArray();
---
SELECT `k`.*, `j`.`nama_jabatan`, `j`.`gaji_pokok`, `j`.`tunj_jabatan`, `j`.`tunj_makan_per_hari`, `j`.`tunj_transport_per_hari`, `u`.`username`, `u`.`email`
FROM `karyawan` `k`
LEFT JOIN `jabatan` `j` ON `j`.`id` = `k`.`jabatan_id`
LEFT JOIN `users` `u` ON `u`.`id` = `k`.`user_id`
WHERE `k`.`user_id` = '2'